; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v8 - type_1 ?v5 - type_2)
 	      (pred_2 ?v2 - object ?v5 - type_2)
	      (pred_1 ?v8 - type_1 ?v6 - type_3)
	      (pred_4 ?v8 - type_1 ?v2 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v3 ?v1 - type_2)
       :precondition (and  (pred_3 ?v8 ?v3))
       :effect (and  (pred_3 ?v8 ?v1)
		     (not (pred_3 ?v8 ?v3))))

   (:action op_2
       :parameters (?v8 - type_1 ?v4 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v7) (pred_3 ?v8 ?v7) (pred_1 ?v8 ?v6))
       :effect (and (pred_4 ?v8 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v7)) 
		    (not (pred_1 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_1 ?v4 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v4 ?v6) (pred_3 ?v8 ?v7))
       :effect (and (pred_2 ?v4 ?v7)
		    (pred_1 ?v8 ?v6)
		    (not (pred_4 ?v8 ?v4 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_02 obj_06 - type_3
obj_08 obj_09 obj_01 - type_2
obj_05 obj_04 obj_03 - object)
(:init
(pred_3 obj_07 obj_08)
(pred_1 obj_07 obj_02)
(pred_1 obj_07 obj_06)
(pred_2 obj_05 obj_09)
(pred_2 obj_04 obj_08)
(pred_2 obj_03 obj_08)
)
(:goal
(and
(pred_2 obj_05 obj_01)
(pred_2 obj_04 obj_01)
(pred_2 obj_03 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_07 ?b obj_06))))
)
)

; plan
1. (op_2 obj_07 obj_04 obj_08 obj_02)
   deleted: (pred_2 obj_04 obj_08) (pred_1 obj_07 obj_02)
   added: (pred_4 obj_07 obj_04 obj_02)
   goals met: 0 of 3
2. (op_1 obj_07 obj_08 obj_01)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_01)
   goals met: 0 of 3
3. (op_3 obj_07 obj_04 obj_01 obj_02)
   deleted: (pred_4 obj_07 obj_04 obj_02)
   added: (pred_2 obj_04 obj_01) (pred_1 obj_07 obj_02)
   goals met: 1 of 3
4. (op_1 obj_07 obj_01 obj_09)
   deleted: (pred_3 obj_07 obj_01)
   added: (pred_3 obj_07 obj_09)
   goals met: 1 of 3
5. (op_2 obj_07 obj_05 obj_09 obj_02)
   deleted: (pred_2 obj_05 obj_09) (pred_1 obj_07 obj_02)
   added: (pred_4 obj_07 obj_05 obj_02)
   goals met: 1 of 3
6. (op_1 obj_07 obj_09 obj_01)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_01)
   goals met: 1 of 3
7. (op_3 obj_07 obj_05 obj_01 obj_02)
   deleted: (pred_4 obj_07 obj_05 obj_02)
   added: (pred_2 obj_05 obj_01) (pred_1 obj_07 obj_02)
   goals met: 2 of 3
8. (op_1 obj_07 obj_01 obj_08)
   deleted: (pred_3 obj_07 obj_01)
   added: (pred_3 obj_07 obj_08)
   goals met: 2 of 3
9. (op_2 obj_07 obj_03 obj_08 obj_02)
   deleted: (pred_2 obj_03 obj_08) (pred_1 obj_07 obj_02)
   added: (pred_4 obj_07 obj_03 obj_02)
   goals met: 2 of 3
10. (op_1 obj_07 obj_08 obj_09)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_09)
   goals met: 2 of 3
11. (op_3 obj_07 obj_03 obj_09 obj_02)
   deleted: (pred_4 obj_07 obj_03 obj_02)
   added: (pred_2 obj_03 obj_09) (pred_1 obj_07 obj_02)
   goals met: 3 of 3
